tap "d12frosted/emacs-plus"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
brew "autoconf"
brew "autojump"
brew "automake"
brew "bash-completion@2"
brew "bat"
brew "bundler-completion"
brew "glib"
brew "python@3.12"
brew "chafa"
brew "chezmoi"
brew "chrome-cli"
brew "yara"
brew "clamav"
brew "cmake"
brew "lima"
brew "colima", restart_service: true
brew "consul-template"
brew "coreutils"
brew "cowsay"
brew "eza"
brew "fd"
brew "findutils"
brew "fortune"
brew "fzf"
brew "gem-completion"
brew "gh"
brew "git"
brew "gnu-getopt"
brew "gnu-sed"
brew "gnu-tar"
brew "grafana", restart_service: true
brew "graphviz"
brew "htop"
brew "httpie"
brew "shared-mime-info"
brew "libheif"
brew "liblqr"
brew "imagemagick"
brew "isync", restart_service: true
brew "jq"
brew "lazygit"
brew "lolcat"
brew "lua"
brew "luajit"
brew "luarocks"
brew "maven"
brew "mkcert"
brew "msmtp"
brew "mu"
brew "neofetch"
brew "tree-sitter"
brew "neovim"
brew "node@20"
brew "nss"
brew "nvm"
brew "openssl@1.1"
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "postgresql@14", restart_service: true
brew "prometheus", restart_service: true
brew "pyenv"
brew "qemu"
brew "rails-completion"
brew "rake-completion"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "ruby-completion"
brew "rust"
brew "shellcheck"
brew "the_silver_searcher"
brew "tldr"
brew "utf8proc"
brew "tmux"
brew "toilet"
brew "unixodbc"
brew "yarn"
brew "yq"
brew "zellij"
brew "zoxide"
brew "d12frosted/emacs-plus/emacs-plus@29", args: ["with-imagemagick", "with-mailutils", "with-native-comp", "with-retro-gnu-meditate-levitate-icon"]
brew "hashicorp/tap/consul"
brew "hashicorp/tap/nomad"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "hashicorp/tap/vault"
brew "puma/puma/puma-dev"
cask "1password-cli"
cask "chromedriver"
cask "emacs"
cask "flycut"
cask "font-hack-nerd-font"
cask "graalvm-jdk"
cask "visual-studio-code"
cask "wezterm"
vscode "4ops.terraform"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "castwide.solargraph"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "davidanson.vscode-markdownlint"
vscode "donjayamanne.githistory"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "hashicorp.terraform"
vscode "hridoy.rails-snippets"
vscode "karunamurti.haml"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode-remote.remote-containers"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "sianglim.slim"
